[
  {
    "id": 0,
    "name": "Hello, Word! – Realtime Chat App",
    "usedTechnologies": "The development technologies: MongoDB + Express + React + Node.js + Mongoose + Zod + socket.io + socket.io-client",
    "description": "This web application is built using the MERN stack, which includes MongoDB for the database, Express for the backend framework, React for the frontend framework, and Node.js for the runtime environment. Additionally, it uses Mongoose for object data modeling (ODM) and Zod for schema validation. The application is designed to provide a comprehensive solution for managing and displaying data. It includes features such as user authentication, data visualization, and CRUD operations. The frontend is built with React, ensuring a dynamic and responsive user interface. The backend is powered by Express and Node.js, providing a robust and scalable server-side solution. MongoDB is used as the database to store and manage data efficiently. Mongoose is used to interact with MongoDB, providing a straightforward and schema-based solution. Zod is used for validating data schemas, ensuring data integrity and consistency. Real-time communication is enabled using socket.io on the backend and socket.io-client on the frontend, allowing for instant messaging and updates.",
    "link": "https://hello-word.khambazarov.dev/",
    "githubLink": "https://github.com/final-project-real-time-chat/realtime-chat",
    "inProgress": false
  },
  {
    "id": 1,
    "name": "Portfolio",
    "usedTechnologies": "The development technologies: Vite + ReactTS + Tailwind",
    "description": "This web application serves as a personal portfolio and contact form. It is designed to showcase projects and provide an easy way for visitors to get in touch. The home page greets visitors and provides a brief introduction. The projects page displays a list of projects with descriptions. Each project has two links for further information: one leading to the live website and the other to the GitHub repository where the source code is hosted. The contact form allows visitors to leave a message. The application is built with modern technologies and practices to ensure a fast and responsive user experience. It uses React for the user interface, TypeScript for type safety, and Vite for efficient development and fast build process. For styling, it uses Tailwind CSS, a utility-first CSS framework that allows for high customization.",
    "link": "https://khambazarov.dev/",
    "githubLink": "https://github.com/Khambazarov/portfolio",
    "inProgress": false
  },
  {
    "id": 2,
    "name": "Randomizer",
    "usedTechnologies": "The development technologies: Vite + ReactJS + CSS",
    "description": "A helpful tool for teachers and students that selects random student from a list. Ideal for classroom activities, quiz games and more.",
    "link": "https://randomizer.khambazarov.dev/",
    "githubLink": "https://github.com/Khambazarov/random-generator",
    "inProgress": false
  },
  {
    "id": 3,
    "name": "Weather",
    "usedTechnologies": "The development technologies: Vite + ReactTS + CSS",
    "description": "A weather forecast app that provides current weather information and forecasts for various cities worldwide.",
    "link": "https://weather.khambazarov.dev/",
    "githubLink": "https://github.com/Khambazarov/weather-ts",
    "inProgress": false
  },
  {
    "id": 4,
    "name": "TODO",
    "usedTechnologies": "The development technologies: Vite + ReactJS + Material – UI + SCSS",
    "description": "An efficient task management application that allows users to organize and track their daily tasks. Users can add, edit, and delete tasks, thereby enhancing their productivity and better managing their time.",
    "link": "https://todo.khambazarov.dev/",
    "githubLink": "https://github.com/Khambazarov/todo",
    "inProgress": false
  },
  {
    "id": 5,
    "name": "Guessing",
    "usedTechnologies": "The development technologies: Vite + ReactJS + CSS",
    "description": "An exciting number guessing game where users have to guess a hidden number within five attempts. This fun game promotes logical thinking and quick decision-making.",
    "link": "https://guessing.khambazarov.dev/",
    "githubLink": "https://github.com/Khambazarov/guess-my-number",
    "inProgress": false
  },
  {
    "id": 6,
    "name": "Memory",
    "usedTechnologies": "The development technologies: Vite + ReactJS + CSS",
    "description": "An exciting number guessing game where users have to guess a hidden number within five attempts. This fun game promotes logical thinking and quick decision-making.",
    "link": "https://memory.khambazarov.dev/",
    "githubLink": "https://github.com/Khambazarov/memory",
    "inProgress": true
  }
]
